import React, { PureComponent } from 'react';

class SLA extends PureComponent {
  /* eslint-disable max-len, react/jsx-one-expression-per-line */
  render() {
    const email = <a href="mailto:help@edly.club">help@edly.club</a>;
    const site = <a href="https://edly.club" target="_blank" rel="noopener noreferrer">edly.club</a>;

    return (
      <div className="b-content">
        <div className="b-page-text">
          <p>
            Настоящее Соглашение является публичной офертой и определяет условия использования материалов и сервисов, размещенных на сайте Продавца в сети Интернет посетителями и пользователями данного интернет- сайта.
          </p>
          <strong>1. Термины, используемые в настоящем соглашении</strong>
          <p>
            1.1. Покупатель (Пользователь) — пользователь сети Интернет, принявший условия настоящего Соглашения, осуществивший регистрацию на Сайте Продавца.
          </p>
          <p>
            1.2. Продавец:
            <br />
            Общество с ограниченной ответственностью «ИЛЛИОН»
            <br />
            Адрес: 195067, Россия, Санкт-Петербург, пр. Пискарёвский, Д. 40а, помещение 1н Оф. 134л
            <br />
            ИНН 7804614807   ОГРН 1187847023100
            <br />
            Расчетный счет 40702810210000328769  в  банке АО «ТИНЬКОФФ БАНК»
            <br />
            БИК 044525974
          </p>
          <p>
            1.3. Произведения — тексты либо аудио-видео-записи литературных произведений (включая обложки, календари, открытки, иллюстрации, пр.), представленные в бумажном виде, а также электронном виде в сети Интернет в различных форматах, размещенные на Сайте, доступные Пользователям посредством Сайта и (или) Мобильных приложений.
          </p>
          <p>
            1.4. Заказ — заявка Пользователя на приобретение Товара из каталога Сайта, оформленная посредством электронной формы на Сайте самим Пользователем. Подтверждением факта оформления Заказа является присвоение ему уникального идентификационного номера.
          </p>
          <p>
            1.5. При оформлении Заказа Клиент указывает следующую информацию:
          </p>
          <ul>
            <li>фамилия, имя Покупателя и Получателя Заказа;</li>
            <li>адрес доставки Заказа;</li>
            <li>контактный телефон;</li>
            <li>способ доставки;</li>
            <li>e-mail;</li>
            <li>пожелание по времени доставки.</li>
          </ul>
          <p>
            1.6. Сайт — информационный ресурс в сети Интернет, расположенный по адресу: {site}, а также страницы Продавца в социальных сетях (instagram.com, vk.com, facebook.com)
          </p>
          <p>
            1.7. Соглашение — настоящее Пользовательское Соглашение, регулирующее отношения между ООО «ИЛЛИОН» и Пользователем.
          </p>
          <p>
            1.8. Скачивание — запись Покупателем Произведений на свой компьютер или иное устройство с использованием Сайта.
          </p>

          <strong>2. Предмет соглашения</strong>
          <p>
            2.1. Продавец предоставляет возможность Покупателю на платной основе приобретать в собственность:
          </p>
          <ul>
            <li>книжную продукцию на бумажных носителях, представленных в каталоге Продавца,</li>
            <li>блокноты, закладки и иные канцелярские товары, в т.ч. в составе подарочных наборов,</li>
            <li>иные произведения.</li>
          </ul>
          <p>
            2.2. Акцептом настоящей публичной оферты является оплата Покупателем Произведений, в соответствии с условиями настоящего Договора
          </p>

          <strong>3. Обязанности сторон</strong>
          <p>
            3.1. Обязанности Продавца:
          </p>
          <p>
            3.1.1. Осуществлять доставку Произведений Покупателю на условиях, указанных в настоящем Соглашении.
          </p>
          <p>
            3.1.2. Не разглашать третьим лицам адрес электронной почты Покупателя, а также прочие сведения, полученные от Покупателя при регистрации, если иное не требуется в целях исполнения договорных обязательств перед Покупателем.
          </p>
          <p>
            3.2. Обязанности Покупателя:
          </p>
          <p>
            3.2.2. Заполнить все обязательные поля в форме заказа на Сайте. Производить оплату за Произведения согласно условиям настоящего Соглашения.
          </p>
          <p>
            3.2.3. Использовать Произведения исключительно в личных целях, а также для иных нужд, не связанных с осуществлением предпринимательской деятельности. Покупатель имеет право размещать копии Произведений на любом персональном устройстве, которое ему принадлежит. Покупатель так же имеет право конвертировать скачанные файлы с текстом Произведений в любые удобные ему форматы (такие, как html, txt, rtf, pdf, BBEb, lit), если такая конвертация требуется для использования Произведений Покупателем.
          </p>
          <p>
            3.2.4. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных прав, общепринятые нормы морали и нравственности, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.
          </p>
          <p>
            3.3. Покупатель не имеет права:
          </p>
          <p>
            3.3.1. передавать либо рассылать приобретенные Произведения третьим лицам как полностью, так и частично;
          </p>
          <p>
            3.3.2. сообщать публично Произведения по любым каналам вещания, таким как радио, телевидение, интернет и др.;
          </p>
          <p>
            3.3.3. осуществлять изготовление (тиражирование) Произведений или их частей в любой форме с целью дальнейшего распространения;
          </p>
          <p>
            3.3.4. доводить Произведения до всеобщего сведения с использованием сети Интернет и прочих цифровых сетей;
          </p>
          <p>
            3.3.5. изменять или прочим образом перерабатывать Произведения.
          </p>
          <p>
            3.4. Покупатель предупрежден о том, что нарушение п.3.2.4. Соглашения является нарушением законодательства об авторском праве и влечет наложение ответственности, предусмотренной действующим законодательством РФ.
          </p>
          <p>
            3.5. Использование материалов Сайта, без согласия правообладателей не допускается. Вся текстовая информация и графические изображения, размещаемые на Сайте, являются собственностью Продавца и его Партнеров.
          </p>
          <p>
            3.6. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна.
          </p>

          <strong>4. Порядок приобретения произведения</strong>
          <p>
            4.1. Для совершения покупки Покупателю требуется заполнить все поля формы Заказа на Сайте.
          </p>
          <p>
            4.2. В случае изменения каких-либо ранее данных, предоставленных Покупателем и необходимых для надлежащего исполнения Продавцом обязательств по продаже и доставке Произведения, Покупатель обязуется незамедлительно уведомить об этом Продавца, направив соответствующее письмо в Службу клиентской поддержки издательства по адресу {email}.
          </p>
          <p>
            4.3. Продавец не несет ответственность за неисполнения и/или ненадлежащего исполнения обязательств по продаже и/или доставке Покупателю Произведения, если указанное нарушение вызвано предоставлением недостоверных и/или недействительных данных о Покупателе, а равно невыполнением Покупателем условий настоящего Соглашения.
          </p>
          <p>
            4.4. Продавец прилагает достаточные усилия, чтобы внешний вид, упаковка и характеристики Произведения соответствовали описаниям, приведенным в каталоге на Сайте. Настоящим Продавец информирует, что фактические внешний вид и упаковка Произведения могут отличаться от описаний, содержащихся на Сайте, в случае внесения изменений в Произведение.
          </p>
          <p>
            4.5. Цена Произведений может измениться на Сайте без предварительного уведомления об этом. Цена Произведений указывается в индивидуальном статусе и подробной карточке Произведения, отображаемым в каталоге на Сайте.
          </p>
          <p>
            4.6. Допускается изменения состава Заказа до его обработки сотрудником операторской службы по согласованию с Покупателем по телефону. При невозможности связаться с Покупателем в течение 7 (Семи) календарных дней с даты оформления Заказа, Заказ может быть аннулирован Продавцом в одностороннем порядке.
          </p>
          <p>
            4.7. Сайт принимает оплату за Произведения в российских рублях согласно действующему законодательству Российской Федерации.
          </p>
          <p>
            4.8. Все вопросы, связанные с приобретением Произведений из каталога на Сайте, Вы можете направить в Службу клиентской поддержки по адресу {email}.
          </p>
          <p>
            4.9. При условии приобретения от 10 позиций одного наименования Продукции предоставляется скидка в размере 10%.
          </p>
          <p>
            4.11.Физическое лицо может приобрести Произведение на Сайте, оплатив его следующими способами:
          </p>
          <ul>
            <li>наличными,</li>
            <li>кредитной картой,</li>
            <li>электронными деньгами.</li>
          </ul>
          <p>
            Оплата Произведений наличными денежными средствами допускается, в случае курьерской доставки. Оплата наличными денежными средствами производится при получении Произведения.
            Оплата Произведения может осуществляться с использованием следующих дебетовых и кредитных карт: Visa, Visa Electron, MasterCard, Maestro.Оплата Произведения электронными деньгами.
            Оплата Произведений может осуществляться с использованием платежных систем Яндекс.Деньги, WebMoney и Visa QIWI Wallet Кошелек. Подробная информация о порядке осуществления платежей содержится на сайтах Яндекс.Деньги, WebMoney, QIWI Кошелек.
            В случае оплаты электронными деньгами и/или кредитной картой подтверждение Заказа осуществляется после поступления денежных средств на расчетный счет Продавца.
          </p>
          <p>
            4.12. Отмена заказа и возврат денег возможны до передачи заявки в службу доставки.
          </p>

          <strong>5. О доставке товара</strong>
          <p>5.1. Продавец осуществляет доставку экземпляра Произведения следующими способами:</p>
          <ul>
            <li>курьерская доставка до Покупателя по России компаниями: Boxberry, IML, DPD, СДЭК.</li>
            <li>курьерская доставка до Покупателя в Казахстан и Белоруссию компанией DPD.</li>
            <li>курьерская доставка до Покупателя в другие страны компанией Shiptor International.</li>
            <li>доставка в пункты самовывоза компаниями: Boxberry, IML, DPD, PickPoint, СДЭК.</li>
            <li>доставка посредством Почты России.</li>
          </ul>
          <p>Покупатель вправе выбрать любой из указанных способов доставки.</p>
          <p>
            5.2. В случае отказа Покупателя от получения Произведения после отправки, оплаченная Покупателем стоимость Произведения подлежит возврату Покупателю за вычетом расходов на доставку Произведения, расходов на обратную пересылку товара на склад (100% от первоначальной стоимости доставки), расходов на расформирование посылки в размере 70 рублей и удержания банковской комиссии в размере 15% от стоимости заказа. Указанная сумма оплачивается Покупателю не позднее, чем в течение 10 рабочих дней с даты предъявления Покупателем соответствующего требования с указанием способа возврата денежных средств в Службу клиентской поддержки по адресу {email}.
          </p>
          <p>
            5.3. Оплата считается произведенной с момента списания денежных средств со счета Продавца.
          </p>
          <p>
            5.4. После оплаты заказа ожидается обработка заказа (упаковка,сортировка, сборка партии в паллету) и затем отправка. Статус заказа на сайте меняется в течение 3-5 дней,поэтому за более точным статусом рекомендуем обратиться в нашу службу поддержки.
          </p>
          <p>
            5.5. Все вопросы, связанные со сроками и условиями доставки Товара, Покупатель может направить в Службу клиентской поддержки Сайта по адресу {email}.
          </p>
          <p>5.6. Стоимость доставки для физических лиц зависит от:</p>
          <ul>
            <li>Веса и количества книг, которые вы заказываете.</li>
            <li>Выбранной доставочной компании.</li>
            <li>Расстояния до города доставки.</li>
          </ul>
          <p>
            5.7. Сроки доставки Произведения Покупателю при выборе способа доставки курьером составляют от 1 (одного) рабочего дня с момента оформления заказа на сайте.
          </p>
          <p>
            5.8. Срок хранения посылки в пунктах самовывоза ограничен. Внимание! Срок хранения посылки указывается в календарных днях и у каждой компании установлены следующие сроки хранения заказов:
          </p>
          <ul>
            <li>Для Почты России составляет 15 (пятнадцать) календарных дней с момента доставки посылки на отделение.</li>
            <li>Для службы DPD срок хранения составляет 14 (четырнадцать) календарных дней с момента доставки посылки в пункт выдачи.</li>
            <li>Для службы PickPoint срок хранения составляет 3 (три) календарных дня с момента доставки посылки в пункт выдачи.</li>
            <li>Для службы Boxberry срок хранения составляет 14 (четырнадцать) календарных дней с момента доставки посылки в пункт выдачи.</li>
            <li>Для службы IML срок хранения составляет 7 (семь) календарных дней с момента доставки посылки в пункт выдачи.</li>
            <li>Для службы СДЭК срок хранения составляет 14 (четырнадцать) календарных дней с момента доставки посылки в пункт выдачи.</li>
            <li>Для службы Shiptor срок хранения составляет 30 (тридцать) календарных дней с момента доставки посылки в пункт выдачи.</li>
          </ul>
          <p>
            5.9. В случае доставки Произведения в пункты самовывоза Покупатель обязуется получить Произведение в пункте самовывоза в течение установленного срока хранения со дня уведомления Покупателя о готовности Произведения к передаче Покупателю. Указанный срок может быть продлен по заявлению Покупателя через службу поддержки {email}.
          </p>
          <p>
            5.10. Продление срока хранения возможно для службы:
          </p>
          <ul>
            <li>Boxberry на 7 (семь) дней, стоимость продления 50 рублей, необходимо написать в службу поддержки {email}.</li>
            <li>СДЭК на неопределенное количество дней, стоимость продления 30 рублей/день.</li>
            <li>IML на срок до 30 (тридцати) дней, стоимость продления бесплатно.</li>
            <li>Почта России не предоставляет возможности продлевать срок хранения.</li>
            <li>DPD не предоставляет возможности продлевать срок хранения.</li>
            <li>PickPoint на 3 (три) дня, стоимость продления бесплатно.</li>
            <li>Shiptor на срок до 30 (тридцати) дней, стоимость продления бесплатно.</li>
          </ul>
          <p>
            5.11. В случае если Покупатель не забрал Произведение, и посылка отправилась на возврат по истечении срока хранения, и Покупатель желает оформить повторную доставку, то:
          </p>
          <ul>
            <li>доставка оплачивается согласно тарифам транспортных компаний</li>
            <li>к стоимости повторной доставки добавляются расходы за возврат товара на склад Продавца в размере 100% от первоначальной цены за доставку.</li>
            <li>удерживается 70 рублей за обработку возврата</li>
          </ul>
          <p>
            5.12. Если Покупатель не успел забрать Произведение и отказывается от повторной доставки, то есть просит возврат средств за Произведение, то:
          </p>
          <ul>
            <li>возврат осуществляется без учета стоимости совершенной доставки;</li>
            <li>от итоговой суммы возврата удерживается также сумма возврата товара на склад Продавца (100% от первоначальной стоимости доставки);</li>
            <li>при возврате удерживается комиссия банка 15%.</li>
            <li>удерживается 70 рублей за обработку возврата</li>
          </ul>
          <p>
            5.13. При получении Произведения Покупатель проверяет ассортимент, количество, качество и стоимость всех Произведений, входящих в Заказ. После получения Произведений претензии Покупателя по ассортименту, количеству, качеству (за исключением скрытых дефектов) и стоимости Произведений не принимаются.
          </p>
          <p>
            5.14. При получении заказа необходимо проверить содержимое посылки в месте вручения, проверить состояние товара, после чего поставить подпись о получении. В случае если посылка была вскрыта не в месте вручения и обнаружены следы порчи товара, вероятность получить компенсацию от службы доставки минимальна и возможен отказ приема претензии.
          </p>
          <p>
            5.15. При оформлении заказа Покупатель обязуется предоставить корректные контактные данные и полностью несет ответственность за предоставленные данные. Для заказов по России номер телефона должен быть российского формата, например +7(999)123-45-67. В случае, если были совершены ошибочные действия Покупателем, Продавец не несет ответственность за отсутствие извещения о доставке по номеру телефона и невозможности получения посылки в установленный срок.
          </p>
          <p>
            5.16. При оформлении заказа зарубеж в ряде стран может взыматься таможенный налог на товар, оценочная стоимость которого превышает почтовый таможенный лимит принимающей страны. Ответственность и обязательство уплаты налога несет Покупатель самостоятельно.
          </p>

          <strong>6. О возврате и обмене произведений</strong>
          <p>
            6.1. Возврат экземпляра Произведений ненадлежащего качества, а также возврат денежных средств осуществляется после письменного обращения в службу поддержки по адресу {email}.
          </p>
          <p>
            6.2. Рассмотрение обращения производится Продавцом в течение 7 (Семи) календарных дней с момента его получения.
          </p>
          <p>
            6.3. Возврат денежных средств осуществляется путем безналичного перечисления денежных средств по банковским реквизитам Продавца.
          </p>
          <p>
            6.4. Отличие фактических элементов дизайна Произведения, включая, но не ограничиваясь цветом, формой или оформлением Произведения, от заявленных в описании на Сайте, не влияет на его качество и не является нарушением условий Соглашения, не может служить основанием для возврата экземпляра Произведения Продавцу.
          </p>
          <p>
            6.5. Все вопросы по возврату или обмену экземпляра Произведения направляются в службу поддержки по адресу {email}.
          </p>
          <p>
            6.6. Покупатель вправе вернуть экземпляр Произведения ненадлежащего качества в течение 7 (семи) календарных дней, не считая дня передачи Покупателю экземпляра Произведения, если сохранены документы, подтверждающие факт и условия покупки данного Произведения на Сайте.
          </p>
          <p>
            6.7. Возврат денежных средств за экземпляр Произведения ненадлежащего качества, будет осуществлен не позднее, чем через 10 (десять) календарных дней с даты оформления возврата экземпляра Произведения Продавцу (или его партнерам).
          </p>
          <p>
            6.8. Для возврата экземпляра Произведения необходимо связаться со службой поддержки по адресу {email}, чтобы заказать курьера на удобный для Покупателя адрес согласно тарифам курьерской доставки, либо самостоятельно доставить экземпляр Произведения Продавцу (или его партнерам) предварительно согласовав время приезда.
          </p>
          <p>
            6.9. Претензии по качеству принимаются в следующем порядке:
          </p>
          <p>
            6.9.1. Претензии по дефектам, иным несоответствиям экземпляра Произведения, которые не носят скрытый характер и могут быть обнаружены при передачи экземпляра Произведения Покупателю в пункте передачи принимаются Продавцом посредством заявки в службу поддержки {email} Покупателем, в течение 2 (два) календарных дней после получения Произведения Покупателем. Покупателю необходимо при этом сфотографировать и заполнить специальный бланк с претензией в пункте передачи экземпляра Произведения, а именно в отделении почты России или пунктах самовывоза Boxberry, IML, DPD, PickPoint, СДЭК. К заявке необходимо прикрепить фотографии дефектов, подтверждение оплаты заказа, и указать номер заказа;
          </p>
          <p>
            6.9.2. Претензии по дефектам, иным несоответствиям Произведения, связанным с ненадлежащим качеством книгопечатной продукции (типографский или производственный) дефект — принимаются Продавцом в течение 20 (двадцати) дней с момента передачи экземпляра Произведения Покупателю.
          </p>
          <p>
            6.10. Под скрытым дефектом признается:
          </p>
          <ul>
            <li>перевернутые, пропущенные, перепутанные страницы;</li>
            <li>зеркальное расположение текста или иллюстраций;</li>
            <li>некомплектность и непоследовательность элементов блока;</li>
            <li>незапечатанные страницы, кроме предусмотренных («белые» листы);</li>
            <li>непропечатка (потеря элементов изображения), «бледная печать», сдвоенная печать;</li>
            <li>склеивание страниц и повреждение текста или иллюстраций при раскрывании;</li>
            <li>срезанный край текста или иллюстраций на полосе («зарезанные» текст или иллюстрации);</li>
            <li>текст или иллюстрации «ушли» в корешок;</li>
            <li>неправильная вставка блока в обложку, блок перевернут, «чужой» блок.</li>
          </ul>
          <p>
            6.11. Скрытым производственным дефектом является отсутствие необходимых элементов, а также наличие лишних ненужных компонентов, которые могут повлечь за собой вред, неудобство или затруднения при использовании книгопечатной продукции.
          </p>
          <p>
            6.12. Продавец не рассматривает и не принимает претензии, связанные с экземпляром Произведения, имеющим следы использования, включая, но не ограничиваясь, повреждения внешнего или внутреннего вида (царапины, сбитые углы, рваные или грязные страницы), сломанные или расколотые части, деформация или выпадение книжного блока, в случае, когда указанные в настоящем пункте повреждения, были выявлены после передачи экземпляра Произведения Покупателю.
          </p>

          <strong>7. Ответственность сторон. Ограничение ответственности продавца</strong>
          <p>
            7.1. Покупатель принимает на себя полную ответственность и риски, связанные с использованием Произведения. Покупатель полностью несет ответственность за использование третьими лицами информации, передаваемой Продавцом на адрес электронной почты, указанный Покупателем при регистрации.
          </p>
          <p>
            7.2. Продавец не несет ответственности за любые расходы Покупателя или прямой либо косвенный ущерб, который может быть нанесен Покупателю вследствие использования Произведения.
          </p>
          <p>
            7.3. Продавец нe нeсeт ответственности за качество доступа к Произведению через сеть Интернет.
          </p>
          <p>
            7.4. Продавец не несет ответственности за прямой или косвенный ущерб, понесенный Покупателем в результате ошибок передачи данных, сбоев/дефектов в работе программного обеспечения и/или оборудования, потерь и повреждений данных, ошибок обработки или отображения данных, задержек в передаче данных и других сбоев, случившихся не по вине Продавца.
          </p>
          <p>
            7.5. Сайт Продавца и все сопутствующие сервисы предоставляются на условиях «как есть», без каких-либо прямых или косвенных гарантий того, что указанные Сайт и (или) сервисы могут подходить или не подходить для конкретных целей использования.
          </p>
          <p>
            7.6. Продавец не несет ответственности за невозможность пользования Сайтом и (или) сопутствующими сервисами Покупателем по каким-либо причинам, включая, но не ограничиваясь: ошибки, упущения, прерывания, удаление, дефекты, задержку в обработке или передаче данных, нарушение работы линий связи, неисправность оборудования, любые технические сбои или иные проблемы любых телефонных сетей или служб, компьютерных систем, серверов или провайдеров, компьютерного или телефонного оборудования, программного обеспечения, невыполнение обязательств поставщиков тех или иных услуг, кражу, уничтожение или неправомерный доступ к материалам других Пользователей, размещенным на Cайте или в любом другом месте и т.п.
          </p>
          <p>
            7.7. Ни при каких обстоятельствах Продавец не несет ответственности за любые расходы Покупателя или прямой либо косвенный ущерб, включая упущенную выгоду или потерянные данные, вред чести, достоинству или деловой репутации, который может быть нанесен Покупателю вследствие использования Сайта, Приложений и (или) сопутствующих сервисов.
          </p>
          <p>
            7.8. Продавец не несет ответственности за посещение и использование внешних ресурсов, ссылки на которые могут содержаться на Сайте.
          </p>
          <p>
            7.9. Продавец не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Покупателя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.
          </p>
          <p>
            7.10. Покупатель согласен с тем, что Продавец не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с рекламой, которая может быть размещена на Сайте.
          </p>

          <strong>8. Разрешение споров</strong>
          <p>
            8.1. Споры и разногласия, которые могут возникнуть по данному Соглашению, решаются путем соблюдения досудебного (претензионного) порядка. Срок рассмотрения претензии — 7 (семь) календарных дней с момента ее получения.
          </p>
          <p>
            8.2. Если Стороны не придут к соглашению, эти споры и разногласия разрешаются в судебном порядке согласно действующему законодательству Российской Федерации.
          </p>

          <strong>9. Прочие условия</strong>
          <p>
            9.1. Соглашение вступает в силу с момента оплаты Покупателем Произведения на Сайте и действует до полного исполнения Сторонами своих обязательств.
          </p>
          <p>
            9.2. Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по настоящему Соглашению в случае, если такое неисполнение явилось прямым следствием обстоятельств непреодолимой силы (форс-мажорных обстоятельств), возникших после присоединения к Соглашению, в результате событий чрезвычайного характера, а именно: пожара, наводнения, урагана землетрясения или наложения органами государственной власти ограничений на деятельность любой из Сторон, и если эти обстоятельства Стороны не могли ни предвидеть, ни предотвратить разумными мерами.
          </p>
          <p>
            9.3. В случае, если какое-либо положение или какая-либо часть положения Соглашения признаны недействительными или не имеющими юридической силы, остальные положения и части положений Соглашения остаются в полной силе и действии.
          </p>
          <p>
            9.4. Все Приложения к настоящему Соглашению являются его неотъемлемой частью: Политика конфиденциальности и Условия доставки.
          </p>
          <p>
            9.5. Во всем остальном Стороны договорились руководствоваться действующим законодательством Российской Федерации.
          </p>
          <p>
            9.6. Продавец вправе вносить изменения в Соглашение с обязательным размещением соответствующей информации на Сайте Продавца.
          </p>
          <p>
            9.7. По всем возникающим вопросам Покупатель вправе обращаться в Службу поддержки Продавца по адресу электронной почты {email}.
          </p>
          <p>
            9.8.  Продавец вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. Покупатель самостоятельно отслеживает изменения в Соглашении. Изменения вступают в силу с момента размещения новой версии Соглашения на сайте.
          </p>
          <p>
            9.9. Регистрируясь на Сайте, Покупатель соглашается с получением сообщений после покупки о совершенной оплате и о составе заказа.
          </p>
          <p>
            9.10. Принимая условия настоящей оферты, Покупатель дает свое согласие на получение рекламы и информации о Продавце и партнерах Продавца, а также информацию о деятельности Продавца и деятельности партнеров Продавца путем получения сообщений на указанный при регистрации номер сотового телефона, включая сообщения в любые мессенджеры по номеру телефона, писем на адрес электронной почты, указанный при регистрации.
          </p>
        </div>
      </div>
    );
  }
  /* eslint-enable max-len, react/jsx-one-expression-per-line */
}

export default SLA;
